## Plan Result (sbox-frontdoor)




<pre><code>Plan: 18 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.frontdoor_for_testing_migration.azurerm_frontdoor.main
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;darts-portal&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;portal-sbox&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;sds-api-mgmt&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;toffee&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;vh-admin-web&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;vh-test-web&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;vh-video-web&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;darts-portal&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;portal-sbox&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;sds-api-mgmt&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;toffee&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;vh-admin-web&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;vh-test-web&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;vh-video-web&#34;]
  * module.frontdoor_for_testing_migration.azurerm_key_vault_access_policy.frontdoor_kv_access[0]
  * module.frontdoor_for_testing_migration.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics
  * module.frontdoor_for_testing_migration.azurerm_role_assignment.frontdoor_kv_access[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.frontdoor_for_testing_migration.azurerm_frontdoor.main will be created
  + resource "azurerm_frontdoor" "main" {
      + backend_pool_health_probes           = (known after apply)
      + backend_pool_load_balancing_settings = (known after apply)
      + backend_pools                        = (known after apply)
      + cname                                = (known after apply)
      + explicit_resource_order              = (known after apply)
      + friendly_name                        = "test-sbox"
      + frontend_endpoints                   = (known after apply)
      + header_frontdoor_id                  = (known after apply)
      + id                                   = (known after apply)
      + load_balancer_enabled                = true
      + name                                 = "test-sbox"
      + resource_group_name                  = "lz-sbox-rg"
      + routing_rules                        = (known after apply)
      + tags                                 = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }

      + backend_pool {
          + health_probe_name   = "defaultHealthProbe"
          + id                  = (known after apply)
          + load_balancing_name = "defaultLoadBalancing"
          + name                = "defaultBackend"

          + backend {
              + address     = "www.bing.com"
              + enabled     = true
              + host_header = "www.bing.com"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-toffee"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-toffee"
          + name                = "toffee"

          + backend {
              + address     = "firewall-sbox-int-palo-sdssbox.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "toffee.sandbox.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-sds-api-mgmt"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-sds-api-mgmt"
          + name                = "sds-api-mgmt"

          + backend {
              + address     = "firewall-sbox-int-palo-sdsapimgmt.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "sds-api-mgmt.sandbox.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-vh-test-web"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-vh-test-web"
          + name                = "vh-test-web"

          + backend {
              + address     = "firewall-sbox-int-palo-sdssbox.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "vh-test-web.sandbox.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-vh-video-web"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-vh-video-web"
          + name                = "vh-video-web"

          + backend {
              + address     = "firewall-sbox-int-palo-sdssbox.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "vh-video-web.sandbox.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-vh-admin-web"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-vh-admin-web"
          + name                = "vh-admin-web"

          + backend {
              + address     = "firewall-sbox-int-palo-sdssbox.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "vh-admin-web.sandbox.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-portal-sbox"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-portal-sbox"
          + name                = "portal-sbox"

          + backend {
              + address     = "pre-sbox.powerappsportals.com"
              + enabled     = true
              + host_header = "portal-sbox.pre-recorded-evidence.justice.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-darts-portal"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-darts-portal"
          + name                = "darts-portal"

          + backend {
              + address     = "firewall-sbox-int-palo-sdssbox.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "darts-portal.sandbox.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }

      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "defaultHealthProbe"
          + path                = "/"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-toffee"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-sds-api-mgmt"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-vh-test-web"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-vh-video-web"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-vh-admin-web"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-portal-sbox"
          + path                = "/SignIn?ReturnUrl=%2F"
          + probe_method        = "GET"
          + protocol            = "Https"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-darts-portal"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }

      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + id                              = (known after apply)
          + name                            = "defaultLoadBalancing"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + id                              = (known after apply)
          + name                            = "loadBalancingSettings-toffee"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + id                              = (known after apply)
          + name                            = "loadBalancingSettings-sds-api-mgmt"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + id                              = (known after apply)
          + name                            = "loadBalancingSettings-vh-test-web"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + id                              = (known after apply)
          + name                            = "loadBalancingSettings-vh-video-web"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + id                              = (known after apply)
          + name                            = "loadBalancingSettings-vh-admin-web"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + id                              = (known after apply)
          + name                            = "loadBalancingSettings-portal-sbox"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + id                              = (known after apply)
          + name                            = "loadBalancingSettings-darts-portal"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }

      + backend_pool_settings {
          + backend_pools_send_receive_timeout_seconds   = 60
          + enforce_backend_pools_certificate_name_check = true
        }

      + frontend_endpoint {
          + host_name                    = "test-sbox.azurefd.net"
          + id                           = (known after apply)
          + name                         = "test-sbox-azurefd-net"
          + session_affinity_enabled     = false
          + session_affinity_ttl_seconds = 0
        }
      + frontend_endpoint {
          + host_name                               = "toffee.sandbox.platform.hmcts.net"
          + id                                      = (known after apply)
          + name                                    = "toffee"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "sds-api-mgmt.sandbox.platform.hmcts.net"
          + id                                      = (known after apply)
          + name                                    = "sds-api-mgmt"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "vh-test-web.sandbox.platform.hmcts.net"
          + id                                      = (known after apply)
          + name                                    = "vh-test-web"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "vh-video-web.sandbox.platform.hmcts.net"
          + id                                      = (known after apply)
          + name                                    = "vh-video-web"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "vh-admin-web.sandbox.platform.hmcts.net"
          + id                                      = (known after apply)
          + name                                    = "vh-admin-web"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "portal-sbox.pre-recorded-evidence.justice.gov.uk"
          + id                                      = (known after apply)
          + name                                    = "portal-sbox"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "darts-portal.sandbox.platform.hmcts.net"
          + id                                      = (known after apply)
          + name                                    = "darts-portal"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }

      + routing_rule {
          + accepted_protocols = [
              + "Http",
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "test-sbox-azurefd-net",
            ]
          + id                 = (known after apply)
          + name               = "defaultRouting"
          + patterns_to_match  = [
              + "/*",
            ]

          + forwarding_configuration {
              + backend_pool_name                     = "defaultBackend"
              + cache_enabled                         = false
              + cache_query_parameter_strip_directive = "StripAll"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "MatchRequest"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "toffee",
            ]
          + id                 = (known after apply)
          + name               = "toffee"
          + patterns_to_match  = [
              + "/*",
            ]

          + forwarding_configuration {
              + backend_pool_name                     = "toffee"
              + cache_enabled                         = true
              + cache_query_parameter_strip_directive = "StripNone"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "sds-api-mgmt",
            ]
          + id                 = (known after apply)
          + name               = "sds-api-mgmt"
          + patterns_to_match  = [
              + "/*",
            ]

          + forwarding_configuration {
              + backend_pool_name                     = "sds-api-mgmt"
              + cache_enabled                         = false
              + cache_query_parameter_strip_directive = "StripAll"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "vh-test-web",
            ]
          + id                 = (known after apply)
          + name               = "vh-test-web"
          + patterns_to_match  = [
              + "/*",
            ]

          + forwarding_configuration {
              + backend_pool_name                     = "vh-test-web"
              + cache_enabled                         = false
              + cache_query_parameter_strip_directive = "StripAll"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "vh-video-web",
            ]
          + id                 = (known after apply)
          + name               = "vh-video-web"
          + patterns_to_match  = [
              + "/*",
            ]

          + forwarding_configuration {
              + backend_pool_name                     = "vh-video-web"
              + cache_enabled                         = false
              + cache_query_parameter_strip_directive = "StripAll"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "vh-admin-web",
            ]
          + id                 = (known after apply)
          + name               = "vh-admin-web"
          + patterns_to_match  = [
              + "/*",
            ]

          + forwarding_configuration {
              + backend_pool_name                     = "vh-admin-web"
              + cache_enabled                         = false
              + cache_query_parameter_strip_directive = "StripAll"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "portal-sbox",
            ]
          + id                 = (known after apply)
          + name               = "portal-sbox"
          + patterns_to_match  = [
              + "/*",
            ]

          + forwarding_configuration {
              + backend_pool_name                     = "portal-sbox"
              + cache_enabled                         = false
              + cache_query_parameter_strip_directive = "StripAll"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpsOnly"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "darts-portal",
            ]
          + id                 = (known after apply)
          + name               = "darts-portal"
          + patterns_to_match  = [
              + "/*",
            ]

          + forwarding_configuration {
              + backend_pool_name                     = "darts-portal"
              + cache_enabled                         = true
              + cache_query_parameter_strip_directive = "StripNone"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "toffee",
            ]
          + id                 = (known after apply)
          + name               = "toffeeHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "sds-api-mgmt",
            ]
          + id                 = (known after apply)
          + name               = "sds-api-mgmtHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "vh-test-web",
            ]
          + id                 = (known after apply)
          + name               = "vh-test-webHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "vh-video-web",
            ]
          + id                 = (known after apply)
          + name               = "vh-video-webHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "vh-admin-web",
            ]
          + id                 = (known after apply)
          + name               = "vh-admin-webHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "portal-sbox",
            ]
          + id                 = (known after apply)
          + name               = "portal-sboxHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "darts-portal",
            ]
          + id                 = (known after apply)
          + name               = "darts-portalHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https["darts-portal"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/test-sbox/frontendEndpoints/darts-portal"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https["portal-sbox"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/test-sbox/frontendEndpoints/portal-sbox"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https["sds-api-mgmt"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/test-sbox/frontendEndpoints/sds-api-mgmt"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https["toffee"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/test-sbox/frontendEndpoints/toffee"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https["vh-admin-web"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/test-sbox/frontendEndpoints/vh-admin-web"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https["vh-test-web"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/test-sbox/frontendEndpoints/vh-test-web"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https["vh-video-web"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/test-sbox/frontendEndpoints/vh-video-web"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["darts-portal"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "dartsportalsbox"
      + resource_group_name   = "lz-sbox-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "error_description"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "connect.sid"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["portal-sbox"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "portalsboxsbox"
      + resource_group_name   = "lz-sbox-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }

      + custom_rule {
          + action                         = "Block"
          + enabled                        = true
          + name                           = "CountryMatchWhitelist"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "GB",
                ]
              + match_variable     = "RemoteAddr"
              + negation_condition = true
              + operator           = "GeoMatch"
            }
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + override {
              + rule_group_name = "RCE"

              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "932100"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "932110"
                }
            }
          + override {
              + rule_group_name = "SQLI"

              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942440"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942450"
                }
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["sds-api-mgmt"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "sdsapimgmtsbox"
      + resource_group_name   = "lz-sbox-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["toffee"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "toffeesbox"
      + resource_group_name   = "lz-sbox-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["vh-admin-web"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "vhadminwebsbox"
      + resource_group_name   = "lz-sbox-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["vh-test-web"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "vhtestwebsbox"
      + resource_group_name   = "lz-sbox-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["vh-video-web"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "vhvideowebsbox"
      + resource_group_name   = "lz-sbox-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_key_vault_access_policy.frontdoor_kv_access[0] will be created
  + resource "azurerm_key_vault_access_policy" "frontdoor_kv_access" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/sds-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedtssdssbox"
      + object_id               = "0a7e9367-4349-4b24-974a-bfa7b23a38fc"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.frontdoor_for_testing_migration.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be created
  + resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-sandbox"
      + name                           = "fd-log-analytics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "FrontdoorAccessLog"

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
      + enabled_log {
          + category = "FrontdoorWebApplicationFirewallLog"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_role_assignment.frontdoor_kv_access[0] will be created
  + resource "azurerm_role_assignment" "frontdoor_kv_access" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0a7e9367-4349-4b24-974a-bfa7b23a38fc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/sds-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedtssdssbox"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 18 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":475,"Program":"tfcmt","SHA1":"","Target":"sbox-frontdoor","Vars":{}} -->